from dataclasses import dataclass


@dataclass
class Texts:
    start: str = """🚀Привет
🔥Я помогу тебе ДЕЛАТЬ РЕКЛАМУ В ПОИСКЕ НА WILDBERRIES В ПЛЮС. 
❗️Мы давно знаем, что огромные предлагаемые ВБ рекламные ставки не соответствуют действительности, РЕАЛЬНЫЕ РЕКЛАМНЫЕ \
СТАВКИ В РАЗЫ МЕНЬШЕ. 

🤖Благодаря мне вы сможете снизить рекламный бюджет в 10, а в каких то категориях и более раз.


🔍Разберём рекламу в поиске на примере категории ПЛАТЬЯ. 
Сверху будет картинка с рекламными ставками в поиске на вб от самого вб, а снизу будут реальные ставки от нашего бота \
поставив которые вы будете показываться на этом месте.


Таким образом поставив ставку 115 руб вместо 7120 руб ( которые предлагает вб) вы будете показываться на первых месте \
в поисковой  выдаче. 


🔥Ну что, хотите сэкономить более 5 500р за 1000 показов одного рекламного объявления?

🤖Так же я умею отслеживать рекламные ставки вам не нужно будет самостоятельно их постоянно проверять, вместо этого \
всего 1 раз добавьте их в отслеживание и каждые 15 минут я буду присылать вам ставки по этому запросу.

Наш канал ➡️ @robo_wb"""
    subscribe: str = """Реквизиты для оплаты

Сбер
4274320077397829
Получатель: Данил Георгиевич Е. 

Тинькофф
5536913942365459
Получатель: Данил Е. 

После оплаты нажмите на кнопку Оплатил(а)"""
    paid: str = """Для подключения мне нужен Ваш id напишите, пожалуйста, этому боту @userinfobot старт. То что он вам \
ответит и чек об оплате отправьте, пожалуйста, администратору @andri_man и он подключит вас в систему робота, вы \
сможете использовать весь его функционал. Так же проконсультирует Вас и ответит на любые вопросы.

После подключения нажмите на команду \\start"""
